---
title: AssemblyDifferenceMemberDifference
classe: Autodesk.Revit.DB.AssemblyDifferenceMemberDifference
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.AssemblyDifference
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# AssemblyDifferenceMemberDifference

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AssemblyMemberDifference MemberDifference { get; }` | `assemblyDifferenceMemberDifference.MemberDifference` | AssemblyMemberDifference |
| `ElementId MemberId1 { get; }` | `assemblyDifferenceMemberDifference.MemberId1` | ElementId |
| `ElementId MemberId2 { get; }` | `assemblyDifferenceMemberDifference.MemberId2` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```